________________________________________________________________
Layer (type)                 Output Shape              Param #
=================================================================
conv2d_1 (Conv2D)            (None, 32, 198, 198)      320
_________________________________________________________________
activation_1 (Activation)    (None, 32, 198, 198)      0
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 32, 196, 196)      9248
_________________________________________________________________
activation_2 (Activation)    (None, 32, 196, 196)      0
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 32, 98, 98)        0
_________________________________________________________________
dropout_1 (Dropout)          (None, 32, 98, 98)        0
_________________________________________________________________
flatten_1 (Flatten)          (None, 307328)            0
_________________________________________________________________
dense_1 (Dense)              (None, 128)               39338112
_________________________________________________________________
activation_3 (Activation)    (None, 128)               0
_________________________________________________________________
dropout_2 (Dropout)          (None, 128)               0
_________________________________________________________________
dense_2 (Dense)              (None, 5)                 645
_________________________________________________________________
activation_4 (Activation)    (None, 5)                 0
=================================================================
Total params: 39,348,325
Trainable params: 39,348,325
Non-trainable params: 0